In [1]:
import numpy as np
import pandas as pd

In [4]:
data = {'Uzbekistan': {2024: 12,2023:40,2022:34,2021:57},
        'Kazakistan': {2024: 29,2023:90,2022:14,2021:7}}
df = pd.DataFrame(data)
df

      Uzbekistan  Kazakistan
2024          12          29
2023          40          90
2022          34          14
2021          57           7

In [9]:
df.loc[2022]

Uzbekistan    34
Kazakistan    14
Name: 2022, dtype: int64

## Index methods

In [11]:
df

      Uzbekistan  Kazakistan
2024          12          29
2023          40          90
2022          34          14
2021          57           7

In [12]:
df.index

Index([2024, 2023, 2022, 2021], dtype='int64')

In [13]:
df.columns

Index(['Uzbekistan', 'Kazakistan'], dtype='object')

In [14]:
"Uzbekistan" in df.columns

True

In [15]:
"Tadjikistan" in df.columns

False

In [16]:
df["Tadjikistan"] = [2,7,9,0.8]

In [17]:
df

      Uzbekistan  Kazakistan  Tadjikistan
2024          12          29          2.0
2023          40          90          7.0
2022          34          14          9.0
2021          57           7          0.8

In [19]:
# we cannot change the value of index in Data Frame

In [3]:
import pandas as pd
info = {'StudentID': {'Miron': 12225252,'Mirsaid':12225253,'Shohruh':12225260,'Asadbey':12225264},
        'Majors': {'Miron': "ISE",'Mirsaid':"Data Science",'Shohruh': "AI",'Asadbey':"IBT"}}
df2 = pd.DataFrame(info)

In [4]:
df2.index.name = 'Names'

In [5]:
df2

         StudentID        Majors
Names
Miron     12225252           ISE
Mirsaid   12225253  Data Science
Shohruh   12225260            AI
Asadbey   12225264           IBT

## Indexing Methods

In [6]:
# append mathod in pandas 
info2 = {'StudentID': {'Miron': 12225252,'Mirsaid':12225253,'Shohruh':12225260},
        'Majors': {'Miron': "ISE",'Mirsaid':"Data Science",'Shohruh': "AI"}}

In [ ]:
from pandas import DataFrame
df2.append(pd.DataFrame(info2)) # this has to work

In [12]:
newind = pd.Index(['Shohruh','Miron','Mirsaid'])
newind

Index(['Shohruh', 'Miron', 'Mirsaid'], dtype='object')

In [15]:
df2

         StudentID        Majors
Names
Miron     12225252           ISE
Mirsaid   12225253  Data Science
Shohruh   12225260            AI
Asadbey   12225264           IBT

In [18]:
newind.isin(df2.index) # isin method is used to see whether that index are between indexes of the dataframe or not

array([ True,  True,  True])

In [19]:
newind.difference(df2.index)

Index([], dtype='object')

In [20]:
df2.index.difference(newind)

Index(['Asadbey'], dtype='object')

In [21]:
df2.index.union(newind)

Index(['Asadbey', 'Miron', 'Mirsaid', 'Shohruh'], dtype='object')

In [22]:
df2.index.delete(0)

Index(['Mirsaid', 'Shohruh', 'Asadbey'], dtype='object', name='Names')

In [23]:
newind

Index(['Shohruh', 'Miron', 'Mirsaid'], dtype='object')

In [24]:
newind.drop('Shohruh')

Index(['Miron', 'Mirsaid'], dtype='object')

In [26]:
df2.index.unique()

Index(['Miron', 'Mirsaid', 'Shohruh', 'Asadbey'], dtype='object', name='Names')

In [27]:
# reindexing

In [29]:
data = {"Year": [2024,2023,2022,2021,2020,2019,2018,2017,2016],
        "Population": [33,31,30.7,30,27,29,20,21,23],
        "Zichlik": [1,1.2,1,3.4,7.77,3,4.5,2.33,3.44]}
df = pd.DataFrame(data)

In [30]:
df

   Year  Population  Zichlik
0  2024        33.0     1.00
1  2023        31.0     1.20
2  2022        30.7     1.00
3  2021        30.0     3.40
4  2020        27.0     7.77
5  2019        29.0     3.00
6  2018        20.0     4.50
7  2017        21.0     2.33
8  2016        23.0     3.44

In [32]:
df.index.name = "year"

In [33]:
df

      Year  Population  Zichlik
year
0     2024        33.0     1.00
1     2023        31.0     1.20
2     2022        30.7     1.00
3     2021        30.0     3.40
4     2020        27.0     7.77
5     2019        29.0     3.00
6     2018        20.0     4.50
7     2017        21.0     2.33
8     2016        23.0     3.44

In [35]:
df.index = [24,23,22,21,20,19,18,17,16]
df

    Year  Population  Zichlik
24  2024        33.0     1.00
23  2023        31.0     1.20
22  2022        30.7     1.00
21  2021        30.0     3.40
20  2020        27.0     7.77
19  2019        29.0     3.00
18  2018        20.0     4.50
17  2017        21.0     2.33
16  2016        23.0     3.44

In [38]:
ind =[24,23,22,21,20,19,18,17,16]
ind.sort()
ind

[16, 17, 18, 19, 20, 21, 22, 23, 24]

In [40]:
# "reindex" return new DataFrame
df.reindex(ind)

    Year  Population  Zichlik
16  2016        23.0     3.44
17  2017        21.0     2.33
18  2018        20.0     4.50
19  2019        29.0     3.00
20  2020        27.0     7.77
21  2021        30.0     3.40
22  2022        30.7     1.00
23  2023        31.0     1.20
24  2024        33.0     1.00

In [42]:
df.reindex([16,17,18]) # using reindex method we can get the part of the dataFrame as well

    Year  Population  Zichlik
16  2016        23.0     3.44
17  2017        21.0     2.33
18  2018        20.0     4.50

In [44]:
df.reindex(index  = range(16,26) ) # if index is not in the list, it adds it to the DataFrame and assign them as NaN

      Year  Population  Zichlik
16  2016.0        23.0     3.44
17  2017.0        21.0     2.33
18  2018.0        20.0     4.50
19  2019.0        29.0     3.00
20  2020.0        27.0     7.77
21  2021.0        30.0     3.40
22  2022.0        30.7     1.00
23  2023.0        31.0     1.20
24  2024.0        33.0     1.00
25     NaN         NaN      NaN

In [45]:
# To Avoid it we can use "method = 'nearest'"
df.reindex(index = range(16,26),method='nearest')

    Year  Population  Zichlik
16  2016        23.0     3.44
17  2017        21.0     2.33
18  2018        20.0     4.50
19  2019        29.0     3.00
20  2020        27.0     7.77
21  2021        30.0     3.40
22  2022        30.7     1.00
23  2023        31.0     1.20
24  2024        33.0     1.00
25  2024        33.0     1.00

In [47]:
# to delete the column we can use the method below as well 
del df["Year"]

In [48]:
df

    Population  Zichlik
24        33.0     1.00
23        31.0     1.20
22        30.7     1.00
21        30.0     3.40
20        27.0     7.77
19        29.0     3.00
18        20.0     4.50
17        21.0     2.33
16        23.0     3.44

In [52]:
df.reindex(columns=['Population']) # we can do it using "reindex" method as well

    Population
24        33.0
23        31.0
22        30.7
21        30.0
20        27.0
19        29.0
18        20.0
17        21.0
16        23.0

In [53]:
df.sample(3) #using "sample" method we can get random rows

    Population  Zichlik
19        29.0     3.00
18        20.0     4.50
17        21.0     2.33

In [54]:
df.loc[[23,22,19,17],['Population']]

    Population
23        31.0
22        30.7
19        29.0
17        21.0

In [55]:
# droping index 
df.index.drop(23)

Index([24, 22, 21, 20, 19, 18, 17, 16], dtype='int64')

In [57]:
df.drop(23)

    Population  Zichlik
24        33.0     1.00
22        30.7     1.00
21        30.0     3.40
20        27.0     7.77
19        29.0     3.00
18        20.0     4.50
17        21.0     2.33
16        23.0     3.44

In [59]:
df.drop([16,19]) # 16 and 19 rows dropped

    Population  Zichlik
24        33.0     1.00
23        31.0     1.20
22        30.7     1.00
21        30.0     3.40
20        27.0     7.77
18        20.0     4.50
17        21.0     2.33

In [61]:
# Droping columns 
df.drop('Zichlik', axis='columns') # as you see the below column with the name of Zichlik has been dropped
# !! no Change in original DataFrame

    Population
24        33.0
23        31.0
22        30.7
21        30.0
20        27.0
19        29.0
18        20.0
17        21.0
16        23.0

In [62]:
# To save the changes we made even in original DataFrame, we can use "inplac = True" method 
df.drop('Zichlik', axis='columns', inplace=True)

In [64]:
df # As you can see the below, change saved in the original DataFrame as well

    Population
24        33.0
23        31.0
22        30.7
21        30.0
20        27.0
19        29.0
18        20.0
17        21.0
16        23.0